{
  "activation": "gelu",
  "architectures": [
    "DistilBertForSequenceClassification"
  ],
  "attention_dropout": 0.1,
  "dim": 768,
  "dropout": 0.1,
  "hidden_dim": 3072,
  "id2label": {
    "0": "anxiety",
    "1": "bipolar",
    "2": "depression",
    "3": "normal",
    "4": "personality disorder",
    "5": "stress",
    "6": "suicidal"
  },
  "initializer_range": 0.02,
  "label2id": {
    "anxiety": 0,
    "bipolar": 1,
    "depression": 2,
    "normal": 3,
    "personality disorder": 4,
    "stress": 5,
    "suicidal": 6
  },
  "max_position_embeddings": 512,
  "model_type": "distilbert",
  "n_heads": 12,
  "n_layers": 6,
  "pad_token_id": 0,
  "qa_dropout": 0.1,
  "seq_classif_dropout": 0.2,
  "sinusoidal_pos_embds": false,
  "tie_weights_": true,
  "torch_dtype": "float32",
  "transformers_version": "4.53.3",
  "vocab_size": 30522
}
